nc: 1
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, GhostConv, [64, 3, 2]]
  - [-1, 1, GhostConv, [128, 3, 2]]
  # 高分辨率层：减少重复次数，降低计算量
  - [-1, 2, C2f, [128, True]]
  - [-1, 1, GhostConv, [256, 3, 2]]
  - [-1, 3, C2f, [256, True]]
  - [-1, 1, GhostConv, [512, 3, 2]]
  # 中高层：保留 CA 注意力，兼顾表达能力
  - [-1, 3, C2f_CA, [512, True]]
  - [-1, 1, GhostConv, [1024, 3, 2]]
  - [-1, 2, C2f_CA, [1024, True]]

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  # P4 特征：通道从 512 压到 320
  - [-1, 2, C2f_CA, [320]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  # P3 特征：通道从 256 压到 160
  - [-1, 2, C2f, [160]]

  # 下采样回 P4：通道从 256 压到 320 对齐
  - [-1, 1, GhostConv, [320, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, C2f_CA, [320]]

  # 下采样回 P5：通道从 512 压到 640
  - [-1, 1, GhostConv, [640, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 2, C2f_CA, [640]]

  # Detect 的输入通道与上面三个输出保持对应 [P3, P4, P5]
  - [[14, 17, 20], 1, Detect, [nc]]