nc: 1
scales:
  n: [0.33, 0.25, 1024]

# Speed-priority variant:
# - Use GhostConv for lightweight convs
# - Replace most C2f_CA with C2f_ECA (cheaper attention)
# - Keep CA only in the deepest stage to preserve accuracy as much as possible

backbone:
  - [-1, 1, GhostConv, [64, 3, 2]]
  - [-1, 1, GhostConv, [128, 3, 2]]
  - [-1, 2, C2f, [128, True]]
  - [-1, 1, GhostConv, [256, 3, 2]]
  - [-1, 3, C2f, [256, True]]
  - [-1, 1, GhostConv, [512, 3, 2]]
  - [-1, 3, C2f_ECA, [512, True]]
  - [-1, 1, GhostConv, [1024, 3, 2]]
  - [-1, 2, C2f_CA, [1024, True]]

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C2f_ECA, [320]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C2f, [160]]

  - [-1, 1, GhostConv, [320, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, C2f_ECA, [320]]

  - [-1, 1, GhostConv, [640, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 2, C2f_ECA, [640]]

  - [[14, 17, 20], 1, Detect, [nc]]
